
**Initializing the backend...**

```diff
+Successfully configured the backend "s3"! Terraform will automatically
+use this backend unless the backend configuration changes.
```

**Initializing provider plugins...**
- Checking for available provider plugins...
- Downloading plugin for provider "aws" (terraform-providers/aws) 2.21.1...

```diff
+Terraform has been successfully initialized!
```
**Refreshing Terraform state in-memory prior to plan...**
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

**aws_s3_bucket.artifact_bucket: Refreshing state... [id=s3pypi-artifacts]**

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
```diff
+    create
```

Terraform will perform the following actions:

  **# aws_s3_bucket.index_bucket** will be created
```diff
+    resource "aws_s3_bucket" "index_bucket" {
+        acceleration_status         = (known after apply)
+        acl                         = "private"
+        arn                         = (known after apply)
+        bucket                      = "s3pypi-index"
+        bucket_domain_name          = (known after apply)
+        bucket_regional_domain_name = (known after apply)
+        force_destroy               = false
+        hosted_zone_id              = (known after apply)
+        id                          = (known after apply)
+        region                      = (known after apply)
+        request_payer               = (known after apply)
+        website_domain              = (known after apply)
+        website_endpoint            = (known after apply)
```

```diff
+        versioning {
+            enabled    = (known after apply)
+            mfa_delete = (known after apply)
```
        }
    }

**Plan:** 1 to add, 0 to change, 0 to destroy.
